import React from 'react';

export default function Lab1() {
  return (
    <>
      <nav>
        <ul>
          <li><button onclick={() => {}} className="meta">Тема, Мета та Посилання</button></li>
          <li><button onclick={() => {}} className="description">Опис предметного середовища</button></li>
          <li><button onclick={() => {}} className="code">Структура документа</button></li>
          <li><button onclick={() => {}} className="resume">Висновки</button></li>
        </ul>
      </nav>

      <div class="meta">
        <h1>Тема, Мета та Посилання</h1>
        
      </div>
      <div class="description">
        <h1>Опис предметного середовища</h1>
        <p>
          У задачі автоматизується процес замовлення страв в ресторані, що необхідно для швидкого пошуку, обробки інформації про страви і продукти, що використовуються в них. Автоматизувавши процес, ресторан зможе виявити саму куповану і популярну продукцію, що дозволить, згодом, стежити за зміною попиту і відповідно складати більш вигідний план закупівель сировини. Дотримання смакам споживачів підвищить популярність організації серед споживачів і збільшить виручку.
        </p>
        <h1>Функціонал</h1>
        <ul>
          <li>Візитівка</li>
          <li>Меню</li>
          <li>Рахунок</li>
          <li>Історія замовлень</li>
          <li>Доставка</li>
          <li>Кошик</li>
          <li>Контакти (+ вакансії)</li>
          <li>Вибіркові/основні інгредієнти</li>
          <li>Акції, подарункові карти</li>
          <li>Авторизація</li>
          <li>Відгуки</li>
        </ul>
      </div>
      <div class="code">
        <h1>Структура документа</h1>
      </div>
      <div class="resume">
        <h1>Висновок</h1>
      </div>
    </>
  )
}
